### Plan for staging
🟢 Add module.intercom_v2.datadog_monitor.service_cpu_usage_monitor[0]
🟢 Add module.intercom_v2.datadog_monitor.service_cpu_utilisation_monitor[0]
🟢 Add module.intercom_v2.datadog_monitor.service_jvm_heap_memory_usage_monitor[0]
🟢 Add module.intercom_v2.datadog_monitor.service_memory_utilisation_monitor[0]
🟢 Add module.intercom_v2.module.java_ecs_service.aws_appautoscaling_target.autoscaling_target[0]
🟢 Add module.intercom_v2.module.java_ecs_service.aws_cloudwatch_log_group.aws_for_fluent_bit_sidecar_log_group
🟢 Add module.intercom_v2.module.java_ecs_service.aws_ecs_service.ecs_canary
🟢 Add module.intercom_v2.module.java_ecs_service.aws_ecs_service.ecs_service[0]
🟢 Add module.intercom_v2.module.java_ecs_service.aws_ecs_task_definition.service_task_definition
🟢 Add module.intercom_v2.module.java_ecs_service.aws_iam_policy.appmesh[0]
🟢 Add module.intercom_v2.module.java_ecs_service.aws_iam_role.task_execution_role
🟢 Add module.intercom_v2.module.java_ecs_service.aws_iam_role.task_role
🟢 Add module.intercom_v2.module.java_ecs_service.aws_iam_role_policy_attachment.appmesh[0]
🟢 Add module.intercom_v2.module.java_ecs_service.aws_iam_role_policy_attachment.execution_role_retrieve_datadog_secret_policy_attachment
🟢 Add module.intercom_v2.module.java_ecs_service.aws_iam_role_policy_attachment.task_execution_role_policy_attachment
🟢 Add module.intercom_v2.module.java_ecs_service.aws_service_discovery_service.canary_discovery_service[0]
🟢 Add module.intercom_v2.module.java_ecs_service.aws_service_discovery_service.service_discovery_service[0]
🟢 Add module.intercom_v2.module.java_ecs_service.module.appmesh[0].aws_appmesh_route.appmesh
🟢 Add module.intercom_v2.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_node.appmesh
🟢 Add module.intercom_v2.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_node.canary[0]
🟢 Add module.intercom_v2.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_router.appmesh
🟢 Add module.intercom_v2.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_service.appmesh
🟢 Add module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group.this_name_prefix[0]
🟢 Add module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.egress_with_cidr_blocks[0]
🟢 Add module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]
🟢 Add module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[1]
🟢 Add module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[2]
🟢 Add module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[3]
🟢 Add module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[4]
🟢 Add module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[5]

**30 to add, 0 to modify, 0 to replace, 0 to delete**

<details><summary>Show detailed plan</summary>

```terraform
Terraform will perform the following actions:

  # module.intercom_v2.datadog_monitor.service_cpu_usage_monitor[0] will be created
  + resource "datadog_monitor" "service_cpu_usage_monitor" {
      + enable_samples      = (known after apply)
      + evaluation_delay    = (known after apply)
      + id                  = (known after apply)
      + include_tags        = true
      + message             = <<-EOT
            The CPU usage for staging uk-multi-intercom-v2 in the last 15m is high at {{value}}%.
                {{^is_warning}}
                Notify:
                    @slack-multi-product-alerts
                    
                {{/is_warning}}
        EOT
      + name                = "uk-multi-intercom-v2 staging JVM CPU load monitor (Terraform)"
      + new_host_delay      = 300
      + notify_no_data      = false
      + query               = "avg(last_15m):max:jvm.cpu_load.process{env:staging,service:uk-multi-intercom-v2} * 100 > 85"
      + require_full_window = true
      + tags                = [
          + "env:staging",
          + "service:uk-multi-intercom-v2",
          + "team:multi-product",
          + "terraform",
        ]
      + type                = "query alert"

      + monitor_thresholds {
          + critical = "85"
          + warning  = "75"
        }
    }

  # module.intercom_v2.datadog_monitor.service_cpu_utilisation_monitor[0] will be created
  + resource "datadog_monitor" "service_cpu_utilisation_monitor" {
      + enable_samples      = (known after apply)
      + evaluation_delay    = (known after apply)
      + id                  = (known after apply)
      + include_tags        = true
      + message             = <<-EOT
            The CPU utilisation for staging uk-multi-intercom-v2 in the last 15m is high at {{value}}%.
                Notify:
                    @slack-multi-product-alerts
        EOT
      + name                = "uk-multi-intercom-v2 staging ECS CPU utilisation monitor (Terraform)"
      + new_host_delay      = 300
      + notify_no_data      = false
      + query               = "avg(last_15m):avg:aws.ecs.service.cpuutilization{env:staging,service:intercom-v2} > 80"
      + require_full_window = true
      + tags                = [
          + "env:staging",
          + "service:uk-multi-intercom-v2",
          + "team:multi-product",
          + "terraform",
        ]
      + type                = "query alert"

      + monitor_thresholds {
          + critical = "80"
          + warning  = "70"
        }
    }

  # module.intercom_v2.datadog_monitor.service_jvm_heap_memory_usage_monitor[0] will be created
  + resource "datadog_monitor" "service_jvm_heap_memory_usage_monitor" {
      + enable_samples      = (known after apply)
      + evaluation_delay    = (known after apply)
      + id                  = (known after apply)
      + include_tags        = true
      + message             = <<-EOT
            The memory usage for staging uk-multi-intercom-v2 in the last 15m is high at {{value}}%.
                Notify:
                    @slack-multi-product-alerts
        EOT
      + name                = "uk-multi-intercom-v2 staging JVM heap memory usage monitor (Terraform)"
      + new_host_delay      = 300
      + notify_no_data      = false
      + query               = "avg(last_15m):(max:jvm.heap_memory{env:staging,service:uk-multi-intercom-v2} / max:jvm.heap_memory_max{env:staging,service:uk-multi-intercom-v2}) * 100 > 90"
      + require_full_window = true
      + tags                = [
          + "env:staging",
          + "service:uk-multi-intercom-v2",
          + "team:multi-product",
          + "terraform",
        ]
      + type                = "query alert"

      + monitor_thresholds {
          + critical = "90"
          + warning  = "85"
        }
    }

  # module.intercom_v2.datadog_monitor.service_memory_utilisation_monitor[0] will be created
  + resource "datadog_monitor" "service_memory_utilisation_monitor" {
      + enable_samples      = (known after apply)
      + evaluation_delay    = (known after apply)
      + id                  = (known after apply)
      + include_tags        = true
      + message             = <<-EOT
            The memory utilisation for staging uk-multi-intercom-v2 in the last 15m is high at {{value}}%.
                Notify:
                    @slack-multi-product-alerts
        EOT
      + name                = "uk-multi-intercom-v2 staging ECS memory utilisation monitor (Terraform)"
      + new_host_delay      = 300
      + notify_no_data      = false
      + query               = "max(last_15m):max:aws.ecs.service.memory_utilization.maximum{env:staging,service:intercom-v2} > 95"
      + require_full_window = true
      + tags                = [
          + "env:staging",
          + "service:uk-multi-intercom-v2",
          + "team:multi-product",
          + "terraform",
        ]
      + type                = "query alert"

      + monitor_thresholds {
          + critical = "95"
          + warning  = "90"
        }
    }

  # module.intercom_v2.module.java_ecs_service.data.aws_iam_policy_document.appmesh[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "appmesh" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "appmesh:StreamAggregatedResources",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.intercom_v2.module.java_ecs_service.aws_appautoscaling_target.autoscaling_target[0] will be created
  + resource "aws_appautoscaling_target" "autoscaling_target" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 1
      + min_capacity       = 1
      + resource_id        = "service/staging-cluster/intercom-v2-service"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }
    }

  # module.intercom_v2.module.java_ecs_service.aws_cloudwatch_log_group.aws_for_fluent_bit_sidecar_log_group will be created
  + resource "aws_cloudwatch_log_group" "aws_for_fluent_bit_sidecar_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "intercom-v2-aws-for-fluent-bit-sidecar-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "service" = "intercom-v2"
        }
      + tags_all          = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "intercom-v2"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }
    }

  # module.intercom_v2.module.java_ecs_service.aws_ecs_service.ecs_canary will be created
  + resource "aws_ecs_service" "ecs_canary" {
      + cluster                            = "arn:aws:ecs:eu-west-1:545209064596:cluster/staging-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "intercom-v2-canary-service"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "TASK_DEFINITION"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "service" = "intercom-v2"
        }
      + tags_all                           = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "intercom-v2"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-007f32d8a19bf9887",
              + "subnet-052aa94327f828813",
              + "subnet-05e2b6ffbdc04cee2",
            ]
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # module.intercom_v2.module.java_ecs_service.aws_ecs_service.ecs_service[0] will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:eu-west-1:545209064596:cluster/staging-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "intercom-v2-service"
      + platform_version                   = (known after apply)
      + propagate_tags                     = "TASK_DEFINITION"
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "service" = "intercom-v2"
        }
      + tags_all                           = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "intercom-v2"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-007f32d8a19bf9887",
              + "subnet-052aa94327f828813",
              + "subnet-05e2b6ffbdc04cee2",
            ]
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # module.intercom_v2.module.java_ecs_service.aws_ecs_task_definition.service_task_definition will be created
  + resource "aws_ecs_task_definition" "service_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "512"
      + execution_role_arn       = (known after apply)
      + family                   = "intercom-v2"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "service" = "intercom-v2"
          + "version" = "0.0.2-1"
        }
      + tags_all                 = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "intercom-v2"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
          + "version"        = "0.0.2-1"
        }
      + task_role_arn            = (known after apply)

      + proxy_configuration {
          + container_name = "envoy"
          + properties     = {
              + "AppPorts"         = "8080"
              + "EgressIgnoredIPs" = "169.254.170.2,169.254.169.254"
              + "IgnoredUID"       = "1337"
              + "ProxyEgressPort"  = "15001"
              + "ProxyIngressPort" = "15000"
            }
          + type           = "APPMESH"
        }

      + runtime_platform {
          + cpu_architecture        = "ARM64"
          + operating_system_family = "LINUX"
        }
    }

  # module.intercom_v2.module.java_ecs_service.aws_iam_policy.appmesh[0] will be created
  + resource "aws_iam_policy" "appmesh" {
      + arn         = (known after apply)
      + description = "Allows the task access to specified appmesh node"
      + id          = (known after apply)
      + name        = "intercom-v2-ecs-appmesh-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }
    }

  # module.intercom_v2.module.java_ecs_service.aws_iam_role.task_execution_role will be created
  + resource "aws_iam_role" "task_execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "intercom-v2-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "service" = "intercom-v2"
        }
      + tags_all              = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "intercom-v2"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }
      + unique_id             = (known after apply)
    }

  # module.intercom_v2.module.java_ecs_service.aws_iam_role.task_role will be created
  + resource "aws_iam_role" "task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "intercom-v2-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "service" = "intercom-v2"
        }
      + tags_all              = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "intercom-v2"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }
      + unique_id             = (known after apply)
    }

  # module.intercom_v2.module.java_ecs_service.aws_iam_role_policy_attachment.appmesh[0] will be created
  + resource "aws_iam_role_policy_attachment" "appmesh" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "intercom-v2-task-role"
    }

  # module.intercom_v2.module.java_ecs_service.aws_iam_role_policy_attachment.execution_role_retrieve_datadog_secret_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "execution_role_retrieve_datadog_secret_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::545209064596:policy/terraform-retrieve-datadog-api-key-secret-policy"
      + role       = "intercom-v2-task-execution-role"
    }

  # module.intercom_v2.module.java_ecs_service.aws_iam_role_policy_attachment.task_execution_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "task_execution_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "intercom-v2-task-execution-role"
    }

  # module.intercom_v2.module.java_ecs_service.aws_service_discovery_service.canary_discovery_service[0] will be created
  + resource "aws_service_discovery_service" "canary_discovery_service" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "intercom-v2-canary"
      + namespace_id  = (known after apply)
      + tags          = {
          + "service" = "intercom-v2"
        }
      + tags_all      = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "intercom-v2"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = "ns-dmygbsmhmooiffcs"
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 1
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.intercom_v2.module.java_ecs_service.aws_service_discovery_service.service_discovery_service[0] will be created
  + resource "aws_service_discovery_service" "service_discovery_service" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "intercom-v2"
      + namespace_id  = (known after apply)
      + tags          = {
          + "service" = "intercom-v2"
        }
      + tags_all      = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "intercom-v2"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }
      + type          = (known after apply)

      + dns_config {
          + namespace_id   = "ns-dmygbsmhmooiffcs"
          + routing_policy = "MULTIVALUE"

          + dns_records {
              + ttl  = 1
              + type = "A"
            }
        }

      + health_check_custom_config {
          + failure_threshold = 1
        }
    }

  # module.intercom_v2.module.java_ecs_service.module.appmesh[0].aws_appmesh_route.appmesh will be created
  + resource "aws_appmesh_route" "appmesh" {
      + arn                 = (known after apply)
      + created_date        = (known after apply)
      + id                  = (known after apply)
      + last_updated_date   = (known after apply)
      + mesh_name           = "marshmallow"
      + mesh_owner          = "404219829648"
      + name                = "intercom-v2"
      + resource_owner      = (known after apply)
      + tags_all            = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }
      + virtual_router_name = "intercom-v2"

      + spec {
          + http_route {
              + action {
                  + weighted_target {
                      + virtual_node = "intercom-v2"
                      + weight       = 100
                    }
                  + weighted_target {
                      + virtual_node = "intercom-v2-canary"
                      + weight       = 0
                    }
                }
              + match {
                  + prefix = "/"
                }
              + retry_policy {
                  + http_retry_events = [
                      + "gateway-error",
                      + "stream-error",
                    ]
                  + max_retries       = 0
                  + tcp_retry_events  = [
                      + "connection-error",
                    ]

                  + per_retry_timeout {
                      + unit  = "s"
                      + value = 60
                    }
                }
              + timeout {
                  + per_request {
                      + unit  = "s"
                      + value = 60
                    }
                }
            }
        }
    }

  # module.intercom_v2.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_node.appmesh will be created
  + resource "aws_appmesh_virtual_node" "appmesh" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + mesh_name         = "marshmallow"
      + mesh_owner        = "404219829648"
      + name              = "intercom-v2"
      + resource_owner    = (known after apply)
      + tags_all          = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }

      + spec {
          + listener {
              + health_check {
                  + healthy_threshold   = 2
                  + interval_millis     = 5000
                  + path                = "/actuator/health"
                  + port                = 8080
                  + protocol            = "http"
                  + timeout_millis      = 2000
                  + unhealthy_threshold = 2
                }
              + port_mapping {
                  + port     = 8080
                  + protocol = "http"
                }
              + timeout {
                  + http {
                      + per_request {
                          + unit  = "s"
                          + value = 60
                        }
                    }
                }
            }
          + service_discovery {
              + aws_cloud_map {
                  + namespace_name = "local"
                  + service_name   = "intercom-v2"
                }
            }
        }
    }

  # module.intercom_v2.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_node.canary[0] will be created
  + resource "aws_appmesh_virtual_node" "canary" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + mesh_name         = "marshmallow"
      + mesh_owner        = "404219829648"
      + name              = "intercom-v2-canary"
      + resource_owner    = (known after apply)
      + tags_all          = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }

      + spec {
          + listener {
              + port_mapping {
                  + port     = 8080
                  + protocol = "http"
                }
              + timeout {
                  + http {
                      + per_request {
                          + unit  = "s"
                          + value = 60
                        }
                    }
                }
            }
          + service_discovery {
              + aws_cloud_map {
                  + namespace_name = "local"
                  + service_name   = "intercom-v2-canary"
                }
            }
        }
    }

  # module.intercom_v2.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_router.appmesh will be created
  + resource "aws_appmesh_virtual_router" "appmesh" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + mesh_name         = "marshmallow"
      + mesh_owner        = "404219829648"
      + name              = "intercom-v2"
      + resource_owner    = (known after apply)
      + tags_all          = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }

      + spec {
          + listener {
              + port_mapping {
                  + port     = 8080
                  + protocol = "http"
                }
            }
        }
    }

  # module.intercom_v2.module.java_ecs_service.module.appmesh[0].aws_appmesh_virtual_service.appmesh will be created
  + resource "aws_appmesh_virtual_service" "appmesh" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + mesh_name         = "marshmallow"
      + mesh_owner        = "404219829648"
      + name              = "intercom-v2.local"
      + resource_owner    = (known after apply)
      + tags_all          = {
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }

      + spec {
          + provider {
              + virtual_router {
                  + virtual_router_name = "intercom-v2"
                }
            }
        }
    }

  # module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "intercom-v2-security-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "intercom-v2-security-group"
          + "service" = "intercom-v2"
        }
      + tags_all               = {
          + "Name"           = "intercom-v2-security-group"
          + "Terraform"      = "true"
          + "product"        = "multi"
          + "product_region" = "uk"
          + "service"        = "intercom-v2"
          + "service_name"   = "intercom-v2"
          + "team"           = "multi-product"
        }
      + vpc_id                 = "vpc-03e5c953acbcda81b"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.egress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress Rule"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.7.1.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.7.2.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[2] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.7.3.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[3] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.14.8.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[4] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.14.7.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.intercom_v2.module.java_ecs_service.module.task_security_group.aws_security_group_rule.ingress_with_cidr_blocks[5] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "10.14.6.0/24",
        ]
      + description              = "Ingress Rule"
      + from_port                = 8080
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 30 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: staging.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "staging.plan"

```
</details>